Repository: amryakout2024/SlimWaist.Maui
Catalog: SlimWaist/Languages/AppResource.*.resx
Languages: ar_sa

# LoginPageTitle
source: Easy way for weight loss
ar_sa: أسهل طريقة للتخسيس

# RegexValidationMessage
source: error
ar_sa: خطأ

# LoginPageLabelAddNewMembership
source: register for new
ar_sa: بتسجيل جديد

# LoginPageLabelHaveNoMembership
source: If you don't have membership
ar_sa: اذا لم يكن لك عضوية قم

# LoginPageCheckBox
source: Save email and password
ar_sa: حفظ بيانات الدخول

# LoginPageButtonLogin
source: Log in
ar_sa: دخول

source: Email
ar_sa: الإيميل

source: Password
ar_sa: كلمة السر

source: Name
ar_sa: الإسم

source: Height
ar_sa: الطول

source: Weight
ar_sa: الوزن

source: Current weight
ar_sa: الوزن الحالي

source: Male
ar_sa: ذكر

source: Female
ar_sa: أنثي

source: Save
ar_sa: حفظ

source: Update
ar_sa: تحديث

source: Update Password
ar_sa: تحديث كلمة المرور

source: Select Body Activity
ar_sa: اختر نشاط الجسم

source: Home
ar_sa: الرئيسية

source: Foods
ar_sa: الأغذية

source: My meals
ar_sa: وجباتي

source: Cart
ar_sa: السلة

source: Settings
ar_sa: الإعدادات

source: Welcome back
ar_sa: مرحبا بعودتك

source: Body mass analysis
ar_sa: تحليل كتلة الجسم

source: Edit
ar_sa: تعديل

# Bodymassindex
source: Body mass index (BMI)
ar_sa: مؤشر كتلة الجسم

source: Ideal weight
ar_sa: الوزن المثالي

source: Modified weight
ar_sa: الوزن المعدل

source: Body activity
ar_sa: نشاط الجسم

source: Total energy
ar_sa: السعرات الكلية

source: Current regieme
ar_sa: نظام الدايت الحالي

source: Show all
ar_sa: عرض الكل

source: No regieme till now !
ar_sa: مفيش اي نظام دايت لسه !

source: Start regieme
ar_sa: ابدأ الدايت

source: New membership
ar_sa: عضوية جديدة

source: Birth date
ar_sa: تاريخ الميلاد

source: Waist circumference
ar_sa: محيط الخصر

source: Obesity degree
ar_sa: درجة السمنة

source: Waist circumference evaluation
ar_sa: تقييم محيط الخصر

source: Slim waste
ar_sa: الوسط الرشيق

source: Edit profile
ar_sa: تعديل تفاصيل الحساب

source: Language
ar_sa: اللغة

source: Terms and conditions
ar_sa: الشروط و الأحكام

source: Contact us
ar_sa: تواصل معنا

source: Do you like the app?
ar_sa: هل أعجبك التطبيق ؟

source: Exit
ar_sa: تسجيل الخروج

# Version
source: Version 1.5.1
ar_sa: الإصدار 1.5.1

source: Edit membership
ar_sa: تعديل العضوية

source: Diets
ar_sa: أنظمة الدايت

source: Keto diet
ar_sa: نظام الكيتو

# Ketodescription
source: The keto diet is a low-carb, high-fat diet that helps the body enter ketosis, where it burns fat for energy instead of carbs. It includes foods like meat, eggs, cheese, oils, and non-starchy vegetables, while avoiding bread, sugar, pasta, and most fruits. Benefits include weight loss and steady energy. Some may experience side effects like fatigue or headache at first.
ar_sa: نظام الكيتو هو نظام غذائي منخفض الكربوهيدرات وعالي الدهون يساعد الجسم على الدخول في حالة الكيتوزية، حيث يحرق الدهون للحصول على الطاقة بدلاً من الكربوهيدرات. يشمل الأطعمة مثل اللحوم، البيض، الجبن، الزيوت، والخضروات غير النشوية، مع تجنب الخبز، السكر، المعكرونة، ومعظم الفواكه. تشمل الفوائد فقدان الوزن وزيادة الطاقة المستمرة. قد يواجه البعض آثارًا جانبية مثل التعب أو الصداع في البداية.

source: Low carb diet
ar_sa: نظام منخفض السعرات

# Lowcarbdescription
source: A low-calorie diet limits daily calorie intake, typically between 1200–1800 calories, to support weight loss and improve overall health. It emphasizes nutrient-rich foods like vegetables, fruits, lean proteins, and whole grains, while reducing sugars, fried foods, and processed snacks. This diet helps create a calorie deficit, which encourages the body to burn stored fat. For best results, it should be balanced to provide essential nutrients and may be adjusted based on age, activity level, and health goals.
ar_sa: نظام غذائي منخفض السعرات يحد من تناول السعرات الحرارية اليومية، عادة بين 1200-1800 سعرة حرارية، لدعم فقدان الوزن وتحسين الصحة العامة. يركز على الأطعمة الغنية بالعناصر الغذائية مثل الخضروات، الفواكه، البروتينات الخفيفة، والحبوب الكاملة، مع تقليل السكر، الأطعمة المقلية، والوجبات الخفيفة المصنعة. يساعد هذا النظام في خلق عجز حراري، مما يشجع الجسم على حرق الدهون المخزنة. للحصول على أفضل النتائج، يجب أن يكون النظام متوازنًا لتوفير العناصر الغذائية الأساسية وقد يُعدل بناءً على العمر، مستوى النشاط، والأهداف الصحية.

source: Serving size diet
ar_sa: نظام الحصص

# Servingsizedescription
source: The Serving Size Diet involves controlling portion sizes of different food groups to maintain a balanced diet and avoid overeating. Each food group has a defined serving size, such as 30g of protein (e.g., chicken), 1 cup of vegetables, or ½ cup of grains. This system helps regulate calorie intake while ensuring the body gets the necessary nutrients. It's commonly used for weight management, promoting healthy eating habits, and creating sustainable, balanced meals.
ar_sa: نظام الحصص الغذائي يتضمن التحكم في أحجام الحصص لمجموعات الطعام المختلفة للحفاظ على نظام غذائي متوازن وتجنب الإفراط في تناول الطعام. لكل مجموعة غذائية حجم حصة محدد، مثل 30 غرامًا من البروتين (مثل الدجاج)، 1 كوب من الخضروات، أو نصف كوب من الحبوب. يساعد هذا النظام في تنظيم تناول السعرات الحرارية مع ضمان حصول الجسم على العناصر الغذائية الضرورية. يُستخدم عادةً لإدارة الوزن، وتعزيز عادات الأكل الصحية، وخلق وجبات متوازنة ومستدامة.

source: Prepare your favorite meal
ar_sa: قم بانشاء وجبتك المفضلة

source: Meal
ar_sa: الوجبة

source: Breakfast
ar_sa: إفطار

source: Lunch
ar_sa: غداء

source: Dinner
ar_sa: عشاء

source: Calories calculated for each 100 gm
ar_sa: السعرات محسوبة لكل 100 جرام

source: Write food name
ar_sa: اكتب اسم الغذاء

source: No food by this name !
ar_sa: مفيش غذاء بالاسم دا !

source: Food
ar_sa: الغذاء

source: Category
ar_sa: التصنيف

source: Calories
ar_sa: السعرات

source: Carbohydrates
ar_sa: النشويات

source: Protiens
ar_sa: البروتينات

source: Fats
ar_sa: الدهون

source: Fibers
ar_sa: الالياف

source: Add food to meal cart
ar_sa: اضافة صنف لسلة الوجبة

source: Add quantity
ar_sa: ادخل الكمية

source: Add
ar_sa: اضافة

source: Cancel
ar_sa: الغاء

source: Updated successfully
ar_sa: تم التحديث

source: Deleted successfully
ar_sa: تم الحذف

source: Added successfully
ar_sa: تمت الاضافة

source: Add new food
ar_sa: اضافة غذاء جديد

source: Food name
ar_sa: اسم الغذاء

source: Clear all
ar_sa: مسح الكل

source: Meal components
ar_sa: مكونات الوجبة

source: Meal calories
ar_sa: سعرات الوجبة

source: No foods in the cart !
ar_sa: مفيش اصناف في السلة !

source: Grams
ar_sa: الجرامات

source: Meal name exists before
ar_sa: اسم الوجبة موجود مسبقا

source: No items to be added !
ar_sa: لا يوجد اصناف لحفظها

source: Create one day plan
ar_sa: انشاء مخطط وجبات يوم

source: All
ar_sa: الكل

source: Mealname
ar_sa: اسم الوجبة

source: Meal type
ar_sa: اسم الوجبة

source: Total calories
ar_sa: إجمالي السعرات

source: Total carbohydrates
ar_sa: إجمالي النشويات

source: Total protiens
ar_sa: إجمالي البروتين

source: Total fats
ar_sa: إجمالي الدهون

source: Total fibers
ar_sa: إجمالي الالياف

source: Show
ar_sa: عرض

source: Day calories
ar_sa: سعرات اليوم

source: Targeted weight
ar_sa: الوزن المستهدف
